[{"episodeId":"1","title":"Vibe Coding When The Vibes Are Off","shortDescription":"Dillon, Matt & Scott dive into AI's impact on coding, discussing its role in daily work, how to use it effectively, and balancing creativity with automation in 2025.","hosts":[{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["ai","vibe-coding","software-engineering","learning-zone"],"publishTime":1742226011815,"duration":3544,"longDescription":"\nimport {hosts} from '#/hosts';\nimport {Anchor} from '#components/anchor';\n\n<Anchor href={hosts.dillon.socials.website}>Dillon</Anchor>, <Anchor href={hosts.matt.socials.website}>Matt</Anchor> & <Anchor href={hosts.scott.socials.website}>Scott</Anchor> record an episode with some semblance of quality.\n\nThe gang dove directly into software's hottest topic: AI. We believe in using AI in your day to day job to be more successful.\n\nIn this episode we discuss;\n\n- use cases for AI in software development,\n- the fun tasks AI has taken away and,\n- how to be successful using AI tools.\n\nListen to us explain navigating writing code in a world where more and more companies are increasingly advocating the usage of AI at your day job.\n\nHow do we continue to learn and grow as human while still maintaining fun, creativity and human interaction as an engineer in 2025?\n\nAI is a powerful tool used correctly, however that AI will submit to confirmation bias and your role is to prompt AI to be as unbiased as possible to the best of your ability.\n\n### Episode Summary:\n\nIn this episode of The Bikeshed Podcast, hosts Scott Kaye, Matt Hamlin, and Dillon Curry discuss the role of AI in software development, sharing their experiences with various AI-powered tools and debating the impact of AI on engineering workflows, learning, and job satisfaction.\n\nKey Topics Discussed:\n1.\tAI in Software Development\n  - The hosts discuss how AI has become integral to software engineering, particularly for writing code and automating tasks.\n  - Matt introduces the main discussion: how AI is used in development today and the broader implications of its adoption.\n2.\tPreferred AI Tools\n  - Dillon shares that he used Cursor until his company restricted it, forcing him to switch to Copilot, which he finds inferior.\n  - Scott uses NeoVim with NeoCodium and Avante, but acknowledges their limitations compared to Cursor.\n  - Matt relies on Cursor at work, noting that his company prefers it over other AI tools.\n3.\tAI's Impact on Development\n  - AI enables developers to work faster but can remove the learning process.\n  - Over-reliance on AI can lead to shallow understanding of code and a decrease in creativity.\n  - AI often acts like a junior engineer whose code must be reviewed, making debugging a larger part of the job.\n  - Using AI can lead to less collaboration with teammates, as developers tend to consult AI over their colleagues.\n4.\tConcerns About AI in Software Engineering\n  - Some engineers feel less engaged with their work as AI handles boilerplate and repetitive tasks.\n  - AI's agreeable nature can reinforce incorrect assumptions, leading to confirmation bias.\n  - Companies may use AI to increase efficiency and reduce hiring, raising concerns about job displacement.\n5.\tAI vs. Traditional Search (Google)\n  - Unlike Google, where users must craft precise search queries, AI allows more fluid back-and-forth conversations.\n  - AI can provide immediate answers but might not always offer the best or most optimized solution.\n6.\tThe “No AI” Challenge\n  - The hosts agree to a two-and-a-half-day challenge of coding without AI, to evaluate how it affects their work and problem-solving abilities.\n7.\tGame Segment – “Two Takes and a Fake”\n  - Scott introduces a new segment where Matt and Dillon guess which of three AI-related tweets is fake.\n  - Matt wins this round, showing a keen eye for spotting AI discourse trends.\n8.\tWhat's New?\n  - Dillon is learning piano and music theory to slow down and disconnect from work.\n  - Matt is exploring Cloudflare workers and running Deepseek R1 locally for AI experimentation.\n  - Scott is focused on improving his Golang skills and debating Cherry Pepsi Zero vs. Cherry Coke Zero.\n9.\tClosing Thoughts\n  - The hosts discuss burnout, learning in tech, and how side projects keep programming fun.\n  - They tease next week's episode on burnout and side projects.\n\nThe episode wraps up with some lighthearted banter and a call for listeners to like, subscribe, and share.","audioURL":"https://assets.bikeshedpod.com/episodes/1/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/1/captions.vtt","slug":"vibe-coding-when-the-vibes-are-off","fileSizeBytes":85070912}]