[{"episodeId":"3","title":"A Day In The Life: Coding, Coffee, and Commit Messages","shortDescription":"The guys talk about their daily routines, how they remain productive, and then share spicy hot takes!","hosts":[{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["routine","ai","design-systems","two-takes-and-a-fake","spicy-takes","note-taking"],"publishTime":1742995962545,"duration":2303,"longDescription":"<h2>Summary:</h2>\n<p>In this episode of the Bikeshed Podcast, the gang dives into their daily routine exploring their productivity habits and workflows. They also get down and dirty on discussing their spicy takes.</p>\n<p>Daily Routines for Productivity</p>\n<ul>\n<li>Matt: Starts his day with a morning walk and uses Obsidian as a central hub for notes and task management. He reviews notes and Slack to identify action items. He also notes that he finds opportunities to make improvements on other things while doing a given task and acts on it instead of simply noting it.</li>\n<li>Scott: Begins with coffee, checks personal and work emails and Slack, reviews his calendar, and focuses with his headphones and vibes with music.. He uses Obsidian, Notion, or Notes to track tasks and goals, breaking down complex tasks into smaller, manageable parts. He also prioritizes clear communication and task articulation to minimize disruptions.</li>\n<li>Dillon: Prefers working from the office for increased productivity. He maps out his day with a &quot;stand-up update&quot; and clears his email and Slack to minimize distractions and enable focused work periods.</li>\n</ul>\n<p>Follow-up on Daily Routines</p>\n<ul>\n<li>Matt and Scott both use end-of-day summaries to set the stage for the next day.</li>\n<li>Dillon prefers the office to WFH and does not perform an end-of-day summary and stated it&#x27;s something he could work on.</li>\n<li>Matt uses an &quot;outcomes&quot; section in his daily notes to track accomplishments and artifacts, aiding in reviews and progress tracking over time.</li>\n</ul>\n<p>Spicy Takes</p>\n<ul>\n<li>Dillon (Medium): React components often abuse props, violating the single responsibility principle due to a lack of care or education.</li>\n<li>Scott (Hot): Design systems should empathetically conform to user needs and not try to influence design in a specific direction. A bolder take was that design systems shouldn&#x27;t exist at all.</li>\n<li>Matt (Hot Fire): We should not always assume good intent when reviewing code or understanding legacy systems. Sometimes, it&#x27;s necessary to challenge decisions and consider alternative paths.</li>\n</ul>\n<p>Two Takes and a Fake</p>\n<p>The hosts played a round of &quot;Two Takes and a Fake,&quot; a game where they presented three tech-related statements (two real, one fake) and challenged each other to identify the fabrication. Who will win? Tune in and find out!</p>\n<p>What&#x27;s New</p>\n<ul>\n<li>Scott: Been working with UI heavy work to animate webm video files on scroll. Check out the homepage of <a href=\"https://tollbit.com/\">Tollbit</a></li>\n<li>Matt: Released <a href=\"https://github.com/hamlim/vndr/tree/main/packages/vndr\">Vndr</a>, a CLI tool for vendoring (inlining) packages.</li>\n</ul>","audioURL":"https://assets.bikeshedpod.com/episodes/3/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/3/captions.vtt","slug":"a-day-in-the-life-coding-coffee-and-commit-messages","fileSizeBytes":55287558},{"episodeId":"2","title":"Is The Web Getting Worse?!?!?","shortDescription":"Scott and Matt talk about how things have been feeling worse on the internet in recent years, and how everything has focused on incremental optimizations over large innovations.","hosts":[{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["enshittification","shadcn","ai","innovation","optimization"],"publishTime":1742393660624,"duration":3888,"longDescription":"<h2>Summary:</h2>\n<p>This episode of the Bikeshed Podcast explores the concept of &quot;enshittification,&quot; the idea that the quality of products and services deteriorates over time, often accompanied by increased monetization and decreased customer value. They further discuss how this relates to web development and the broader tech industry. They explore potential cultural factors behind this.</p>\n<p>Key Discussion Points:</p>\n<ul>\n<li>Enshittification Examples: The hosts provide examples of enshittification in popular services like Spotify (increased ads with subscription) and Netflix (higher prices for premium features). Facebook is also mentioned as a product that has seemingly declined in popularity as it has aged.</li>\n<li>AI Integration: The hosts discussed the trend of tacking on AI to products just to say that they offer AI features, which can often be annoying and not serve the original purpose of the product.</li>\n<li>Lost Focus on User Needs: They discuss how companies sometimes lose sight of their original mission and focus more on monetization through KPIs rather than solving customer needs. The hosts share that as measures become metrics, they become less valuable over time.</li>\n<li><a href=\"https://grantslatton.com/nobody-cares\">&quot;Nobody Cares&quot; Blog Post</a>: They discuss the Grant Slatton blog post, interpreting it as a reflection of how engineers may be disempowered from caring about the overall product due to narrow focus and lack of agency in larger organizations.</li>\n<li>“Shadification of the Web”: They introduce the term &quot;shadification&quot; to describe the growing trend of websites looking the same due to the widespread use of component libraries like Shadcn/ui (copy-paste) along with Material UI and Bootstrap.</li>\n<li>Optimization vs. Innovation: They discuss how companies often prioritize optimization and A/B testing over true innovation, resulting in a lack of creativity and unique user experiences.</li>\n<li>Performance Costs: Optimizations made at the expense of performance degrade the customer experience.</li>\n<li>Blurred Ownership: In larger companies, it becomes harder to draw ownership lines when there are more people owning things and there isn&#x27;t clear defined guidelines.</li>\n<li>Impact of AI on UI Creativity: The hosts explore the potential for AI to further standardize UI patterns and stifle creativity, as AI models are trained on existing designs and may not generate truly novel solutions.</li>\n<li>AI Dependency: Discussion of companies choosing to support new libraries based on the amount of support AI models know about them and recommend them, which can lead to everything becoming the same.</li>\n</ul>\n<p>Personal Updates:</p>\n<ul>\n<li>Scott has been digging into <a href=\"https://github.com/yetone/avante.nvim\">Avante</a>, finding it helpful for learning Go. He plans to build a backend service in Node and then refactor it to Go as a learning exercise.</li>\n<li>Matt has been experimenting with Cursor&#x27;s Composer agent feature and a tool called <a href=\"https://block.github.io/goose/\">Codename Goose</a>, which uses AI to infer functionality on his computer.</li>\n</ul>","audioURL":"https://assets.bikeshedpod.com/episodes/2/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/2/captions.vtt","slug":"is-the-web-getting-worse","fileSizeBytes":93307007},{"episodeId":"1","title":"Vibe Coding When The Vibes Are Off","shortDescription":"Dillon, Matt & Scott dive into AI's impact on coding, discussing its role in daily work, how to use it effectively, and balancing creativity with automation in 2025.","hosts":[{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["ai","vibe-coding","software-engineering","learning-zone"],"publishTime":1742226011815,"duration":3544,"longDescription":"\n<p><a href=\"https://dilloncurry.vercel.app/\">Dillon</a>, <a href=\"https://matthamlin.me/\">Matt</a> &amp; <a href=\"https://scottykaye.com/\">Scott</a> record an episode with some semblance of quality.</p>\n<p>The gang dove directly into software&#x27;s hottest topic: AI. We believe in using AI in your day to day job to be more successful.</p>\n<p>In this episode we discuss;</p>\n<ul>\n<li>use cases for AI in software development,</li>\n<li>the fun tasks AI has taken away and,</li>\n<li>how to be successful using AI tools.</li>\n</ul>\n<p>Listen to us explain navigating writing code in a world where more and more companies are increasingly advocating the usage of AI at your day job.</p>\n<p>How do we continue to learn and grow as human while still maintaining fun, creativity and human interaction as an engineer in 2025?</p>\n<p>AI is a powerful tool used correctly, however that AI will submit to confirmation bias and your role is to prompt AI to be as unbiased as possible to the best of your ability.</p>\n<h3>Episode Summary:</h3>\n<p>In this episode of The Bikeshed Podcast, hosts Scott Kaye, Matt Hamlin, and Dillon Curry discuss the role of AI in software development, sharing their experiences with various AI-powered tools and debating the impact of AI on engineering workflows, learning, and job satisfaction.</p>\n<p>Key Topics Discussed:</p>\n<ol>\n<li>AI in Software Development</li>\n</ol>\n<ul>\n<li>The hosts discuss how AI has become integral to software engineering, particularly for writing code and automating tasks.</li>\n<li>Matt introduces the main discussion: how AI is used in development today and the broader implications of its adoption.</li>\n</ul>\n<ol start=\"2\">\n<li>Preferred AI Tools</li>\n</ol>\n<ul>\n<li>Dillon shares that he used Cursor until his company restricted it, forcing him to switch to Copilot, which he finds inferior.</li>\n<li>Scott uses NeoVim with NeoCodium and Avante, but acknowledges their limitations compared to Cursor.</li>\n<li>Matt relies on Cursor at work, noting that his company prefers it over other AI tools.</li>\n</ul>\n<ol start=\"3\">\n<li>AI&#x27;s Impact on Development</li>\n</ol>\n<ul>\n<li>AI enables developers to work faster but can remove the learning process.</li>\n<li>Over-reliance on AI can lead to shallow understanding of code and a decrease in creativity.</li>\n<li>AI often acts like a junior engineer whose code must be reviewed, making debugging a larger part of the job.</li>\n<li>Using AI can lead to less collaboration with teammates, as developers tend to consult AI over their colleagues.</li>\n</ul>\n<ol start=\"4\">\n<li>Concerns About AI in Software Engineering</li>\n</ol>\n<ul>\n<li>Some engineers feel less engaged with their work as AI handles boilerplate and repetitive tasks.</li>\n<li>AI&#x27;s agreeable nature can reinforce incorrect assumptions, leading to confirmation bias.</li>\n<li>Companies may use AI to increase efficiency and reduce hiring, raising concerns about job displacement.</li>\n</ul>\n<ol start=\"5\">\n<li>AI vs. Traditional Search (Google)</li>\n</ol>\n<ul>\n<li>Unlike Google, where users must craft precise search queries, AI allows more fluid back-and-forth conversations.</li>\n<li>AI can provide immediate answers but might not always offer the best or most optimized solution.</li>\n</ul>\n<ol start=\"6\">\n<li>The “No AI” Challenge</li>\n</ol>\n<ul>\n<li>The hosts agree to a two-and-a-half-day challenge of coding without AI, to evaluate how it affects their work and problem-solving abilities.</li>\n</ul>\n<ol start=\"7\">\n<li>Game Segment – “Two Takes and a Fake”</li>\n</ol>\n<ul>\n<li>Scott introduces a new segment where Matt and Dillon guess which of three AI-related tweets is fake.</li>\n<li>Matt wins this round, showing a keen eye for spotting AI discourse trends.</li>\n</ul>\n<ol start=\"8\">\n<li>What&#x27;s New?</li>\n</ol>\n<ul>\n<li>Dillon is learning piano and music theory to slow down and disconnect from work.</li>\n<li>Matt is exploring Cloudflare workers and running Deepseek R1 locally for AI experimentation.</li>\n<li>Scott is focused on improving his Golang skills and debating Cherry Pepsi Zero vs. Cherry Coke Zero.</li>\n</ul>\n<ol start=\"9\">\n<li>Closing Thoughts</li>\n</ol>\n<ul>\n<li>The hosts discuss burnout, learning in tech, and how side projects keep programming fun.</li>\n<li>They tease next week&#x27;s episode on burnout and side projects.</li>\n</ul>\n<p>The episode wraps up with some lighthearted banter and a call for listeners to like, subscribe, and share.</p>","audioURL":"https://assets.bikeshedpod.com/episodes/1/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/1/captions.vtt","slug":"vibe-coding-when-the-vibes-are-off","fileSizeBytes":85070912}]