[{"episodeId":"11","title":"Deploy Fast, and Break Things?!","shortDescription":"The gang talks about whether chasing 5-minute deploys is worth it, debating the trade-offs between deployment speed and stability, and why moving fast might sometimes mask the real problems slowing your team down.","hosts":[{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["organizational-velocity","deploys","continuous-deployment"],"publishTime":1760739954471,"duration":2708,"longDescription":"<p>This episode of the Bikeshed Podcast features a discussion on the optimal level of deployment pipeline optimization, sparked by a company&#x27;s desire to achieve five-minute deploys. The co-hosts, Scott, Matt, and Dillon, debate whether aggressively shortening deployment times is always beneficial, or if it can mask underlying problems and sacrifice stability.</p>\n<p>Key Discussion Points:</p>\n<ul>\n<li>Organizational Velocity: The concept of organizational velocity is introduced, emphasizing the importance of moving as fast as possible in the right direction across the entire company, not just in deployment.</li>\n<li>Trade-offs: The discussion highlights potential trade-offs between deployment speed and stability. A core debate emerges around whether prioritizing a 5 minute deployment masks other problems.</li>\n<li>Confidence and Stability: The co-hosts discuss the need for confidence in deploys and the importance of thorough testing, staging environments, and canary deployments to ensure stability, especially for large, established companies.</li>\n<li>Feature Flags: Feature flags are discussed as a tool for managing new feature releases and A/B testing, but also as potential sources of complexity and integration issues.</li>\n<li>Realism vs. Idealism: The co-hosts explore the tension between striving for ideal, hyper-optimized scenarios and acknowledging the constraints and realities of smaller teams and existing systems.</li>\n<li>Continuous Improvement: The importance of continuous improvement and incremental optimization is emphasized, as opposed to large, periodic overhauls.</li>\n<li>Batching Changes vs. Immediate Releases: The conversation touches on the idea of batching certain updates instead of releasing every change immediately.</li>\n</ul>","audioURL":"https://assets.bikeshedpod.com/episodes/11/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/11/captions.vtt","slug":"deploy-fast-and-break-things","fileSizeBytes":64988809},{"episodeId":"10","title":"Managing Dependencies: It Depends","shortDescription":"The gang shares how FAANG-like companies manage their frontend dependencies without pain! Hint! They Don't!","hosts":[{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["dependencies","dependency-management","web-development","npm"],"publishTime":1760735162115,"duration":2830,"longDescription":"<p>This episode of the Bikeshed Podcast dives into dependency management, particularly within the context of front-end projects. The discussion centers around the &quot;one version rule,&quot; a strategy adopted by companies like Wayfair to ensure consistency and reduce bundle sizes by using a single version of each library across all projects. The hosts explore the pros and cons of this approach, as well as alternative dependency management strategies.</p>\n<p>Key Discussion Points:</p>\n<ul>\n<li>Introduction to Dependency Management: Dependency management involves pulling in libraries and managing updates, breaking changes, and inconsistencies across projects.</li>\n<li>The One Version Rule: The one version rule aims to ensure that only one version of each library is used across all projects within an organization. This reduces bundle sizes, avoids conflicts, and promotes consistency. React is used as an example, it typically functions as a singleton, using multiple versions is likely to cause issues.</li>\n<li>Benefits of the One Version Rule:<!-- -->\n<ul>\n<li>Smaller bundle sizes</li>\n<li>Reduced conflicts between libraries</li>\n<li>Increased consistency and shared knowledge across teams</li>\n<li>Faster development and easier onboarding for new engineers</li>\n</ul>\n</li>\n<li>Drawbacks of the One Version Rule:<!-- -->\n<ul>\n<li>Upgrading dependencies can become a large, complex project affecting multiple applications.</li>\n<li>Managing breaking changes and coordinating upgrades can be challenging.</li>\n</ul>\n</li>\n<li>Dependency Upgrade Challenges: Upgrades, especially breaking changes, require significant effort. Teams often postpone upgrades, leading to outdated dependencies and more complex upgrade processes later.</li>\n<li>HubSpot&#x27;s Evergreen Dependency System: HubSpot uses an evergreen dependency system where non-breaking changes to libraries are automatically pulled down by all dependent projects on the next build. This reduces the burden of manual upgrades but requires robust tooling to test and verify changes.</li>\n<li>Trade-offs of Evergreen Dependencies:<!-- -->\n<ul>\n<li>Automatic upgrades can cause unexpected breakages if not properly tested.</li>\n<li>HubSpot uses canary deployments and build tooling to mitigate these risks.</li>\n<li>Build reproducibility becomes difficult as projects always pull the latest dependencies.</li>\n</ul>\n</li>\n<li>Avoiding Breaking Changes: There&#x27;s a growing trend towards avoiding breaking changes in internal libraries to minimize disruption and simplify upgrades.</li>\n<li>Peer Dependencies vs. Direct Dependencies: The hosts discuss the trade-offs between using peer dependencies (where the consumer provides the dependency) and direct dependencies (where the library includes the dependency).</li>\n<li>Airbnb&#x27;s Dependency Management: Airbnb uses a system where applications and libraries don&#x27;t have package.json files but instead use internal project.json files to enable or disable dependencies.</li>\n<li>Internal Tooling and Team Investment: The hosts emphasize the importance of internal tooling and dedicated platform teams to effectively manage dependencies and improve developer experience. Open-source tools can be useful for smaller teams, but larger organizations benefit from custom solutions.</li>\n<li>Building Important Systems by Committee: Building important systems like component libraries or design systems by committee can be challenging without a solid foundation and dedicated focus.</li>\n<li>The Tragedy of the Commons: Without a structured process or team to manage dependencies, it&#x27;s unlikely that individuals will prioritize it, leading to a negative feedback loop of neglect and increasing complexity.</li>\n</ul>\n<blockquote>\n<p>Sorry for not adding a nice graphic describing the library relationships - we&#x27;ll leave that as an exercise to the listener!</p>\n</blockquote>","audioURL":"https://assets.bikeshedpod.com/episodes/10/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/10/captions.vtt","slug":"managing-dependencies-it-depends","fileSizeBytes":67913478},{"episodeId":"9","title":"Are React Server Components Risky?!?","shortDescription":"The gang interviews Matt on this episode, talking about all things React Server Components (RSCs), exploring their benefits, trade-offs, and adoption strategies. The hosts draw on their experiences at Wayfair, Fireworks, and Whoop to provide practical insights for learning and adopting RSCs.","hosts":[{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["react-server-components","RSC","web-development","nextjs","waku","parcel","redwoodSDK","spicy-takes"],"publishTime":1750100443549,"duration":4617,"longDescription":"<p>The gang interviews Matt on this episode, talking about all things React Server Components (RSCs), exploring their benefits, trade-offs, and adoption strategies. The hosts draw on their experiences at Wayfair, Fireworks, and Whoop to provide practical insights for learning and adopting RSCs.</p>\n<h3>Why React Server Components</h3>\n<ul>\n<li>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Improved Time to First Byte (TTFB) via streaming.</li>\n<li>More cohesive view of data dependencies (tighter front-end/back-end coupling).</li>\n<li>Potential for smaller client-side bundles (automatic code splitting).</li>\n</ul>\n</li>\n<li>\n<p><strong>Trade-offs:</strong></p>\n<ul>\n<li>Requires a server layer (which might be a new concept for some React developers).</li>\n</ul>\n</li>\n</ul>\n<h3>Migrating to React Server Components</h3>\n<ul>\n<li><strong>Adoption Strategy:</strong>\n<ul>\n<li>Start page by page (easiest entry point).</li>\n<li>Flip the mental model: Start from the server and work towards the client.</li>\n<li>Need to consider the bundler support for RSCs.</li>\n</ul>\n</li>\n<li><strong>Challenges:</strong>\n<ul>\n<li>You cannot easily swap out a small subsection of your page with an RSC.</li>\n<li>Ensuring the bundler supports RSCs.</li>\n</ul>\n</li>\n<li><strong>Key Considerations:</strong>\n<ul>\n<li>Think about two environments: server and client.</li>\n</ul>\n</li>\n</ul>\n<h3>Understanding RSC Concepts</h3>\n<ul>\n<li><strong>Two Environments:</strong> The importance of understanding server (server components, server actions) and client (client components) environments when using RSCs. Front-end engineers new to server-side development need to be aware of security implications and potential caching issues.</li>\n<li><strong>Frameworks:</strong> Highlighted the importance of understanding the core RSC principles separate from framework implementations like Next.js.</li>\n<li><strong>Not Necessarily Server Rendered:</strong> Clarifying that client components can be server-rendered, avoiding the assumption that client components are solely client-side rendered.</li>\n<li><strong>Resources:</strong> Blog post <a href=\"https://overreacted.io/react-for-two-computers/\">&quot;React for Two Computers&quot; by Dan Abramov</a> is a great resource to learn about the mental model. Also start to look at the other framework implementations to understand that there&#x27;s next features and there are RSC features</li>\n</ul>\n<h3>Standup Updates</h3>\n<ul>\n<li><strong>Dillon:</strong> Using a Dexcom continuous glucose monitor to manage blood sugar levels and migraines.</li>\n<li><strong>Scott:</strong> Getting wedding suits, migrating from Datadog to Grafana monitors.</li>\n<li><strong>Matt:</strong> Working on lyaml translation migration. Experimenting with Parcel&#x27;s RSC integration and Redwood SDK.</li>\n</ul>\n<h2>Links / References:</h2>\n<ul>\n<li><a href=\"https://overreacted.io/react-for-two-computers/\">React for Two Computers by Dan Abramov</a>\n<ul>\n<li>An excellent introduction to the concepts behind React Server Components</li>\n</ul>\n</li>\n<li><a href=\"https://matthamlin.me/2024/october/the-bookkeeping-pattern\">The Bookkeeping Pattern</a>\n<ul>\n<li>A little look at how Scott and Matt leveraged Server Components and Server Functions at Fireworks</li>\n</ul>\n</li>\n<li><a href=\"https://github.com/hamlim/rsc-todos-waku\">Waku RSC Todo App</a></li>\n<li><a href=\"https://github.com/hamlim/rsc-todos-parcel\">Parcel RSC Todo App</a></li>\n<li><a href=\"https://github.com/hamlim/rsc-todos-redwood\">RedwoodSDK RSC Todo App</a></li>\n</ul>","audioURL":"https://assets.bikeshedpod.com/episodes/9/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/9/captions.vtt","slug":"are-react-server-components-risky","fileSizeBytes":110819288},{"episodeId":"8","title":"Monorepo Madness","shortDescription":"The Bikeshed podcast returns after a brief hiatus with hosts Scott Kaye, Matt Hamlin, and Dillon Curry. Tune in to hear the gang talk about keyboards, Scott's Italy trip, monorepos, and our hot takes on CSS!","hosts":[{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["monorepos","css"],"publishTime":1749502997001,"duration":4198,"longDescription":"<p>The Bikeshed podcast returns after a brief hiatus with hosts Scott Kaye, Matt Hamlin, and Dillon Curry. Tune in to hear the gang talk about keyboards, Scott&#x27;s Italy trip, monorepos, and our hot takes on CSS!</p>\n<h2>Stand-up Updates</h2>\n<ul>\n<li>Dillon is dealing with disruptive construction at his house and is taking time off to combat burnout after a large launch at Woop. He has volunteered to be the guild lead of web, but is finding it difficult to motivate others and get things done.</li>\n<li>Scott recaps his recent trip to Italy, highlighting Rome, Florence, Venice, Milan, and Lake Como. He is working on a project at his new job to rebuild GitHub. His project involves visually displaying changes when someone pushes to live. He&#x27;s also rebuilt an open-source keyboard navigation project using <code>useSyncExternalStore</code>, adding new use cases like a command K search palette.</li>\n<li>Matt is migrating translations in Webpack apps to a &quot;postmodern&quot; variant. He rebuilt his website using Waku and is debugging cold start issues on Cloudflare. He also got a new keyboard, the Nuphy Air V2 75, but a V3 model is coming out soon.</li>\n</ul>\n<h2>Monorepos Discussion</h2>\n<p>The main topic shifts to monorepos:</p>\n<ul>\n<li>Definition: A monorepo is a single repository containing multiple projects, packages, or workspaces.</li>\n<li>Popularity: Monorepos are popular at large companies like Google and Meta and are gaining traction in companies of various sizes.</li>\n<li>Experiences: The hosts discuss their experiences with monorepos at Wayfair, HubSpot, and their current companies. They talk about the shift from monoliths to microservices and back to monorepos at Wayfair, the benefits of shared code, and the importance of culture and expectations.</li>\n<li>Key Considerations:<!-- -->\n<ul>\n<li>Company size and number of contributors.</li>\n<li>Deployment speed vs. stability.</li>\n<li>Whether teams need to collaborate across problem spaces.</li>\n<li>The existence of good documentation and onboarding processes.</li>\n<li>The balance between consistency, speed, and safety.</li>\n</ul>\n</li>\n<li>Tooling:  They mention tools like Lerna, Turborepo, and PMPM that support monorepo management.</li>\n<li>Potential Downsides:<!-- -->\n<ul>\n<li>Monorepos can slow down development if not properly managed (e.g., long CI times).</li>\n<li>Developers creating a dependency chain instead of simply reusing code.</li>\n<li>Consistency is hard to maintain.</li>\n</ul>\n</li>\n<li>Monorepo vs. Technical Solution: Adopting a monorepo is often a technical solution to an organizational problem (e.g., aligning teams on coding standards).</li>\n<li>The discussion shifts to how to deal with problems across the board, with more or less monorepos, more or less repos per projects, and things to consider when deciding what approach to use.</li>\n</ul>\n<h2>Team Structure and Code Ownership</h2>\n<ul>\n<li>The discussion pivots to team structure, code ownership, and velocity.</li>\n<li>The hosts discuss the importance of discoverability of dependencies in monorepos.</li>\n<li>Siloed Ownership in the monorepo can lead to faster development and is better for teams.</li>\n<li>Speed in the form of high velocity, along with the proper North Star is critical for success.</li>\n</ul>\n<h2>Spicy Takes: CSS</h2>\n<p>The hosts share some spicy takes, primarily focused on CSS, tune in to the episode to hear them!</p>","audioURL":"https://assets.bikeshedpod.com/episodes/8/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/8/captions.vtt","slug":"monorepo-madness","fileSizeBytes":100761309},{"episodeId":"7","title":"Ditch the Career Ladder","shortDescription":"The gang talks about engineering career levels, approaching promotions, building connections and leverage through time and effort, and why levels don’t really matter.","hosts":[{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["career","levels","keyboards","promotions"],"publishTime":1747748376639,"duration":2699,"longDescription":"<h2>Summary</h2>\n<p>The Bikeshed Podcast introduces its hosts: Scott Kaye (UI guy, coffee curator, powerlifter) and Matt Hamlin (principal engineer, senior engineering lead) and Dillon (Spicy Take) Curry. They cover software engineering, tech events, and Discord emojis.</p>\n<h3>Keyboard Discussion</h3>\n<p>Dillon discusses his <a href=\"https://nuphy.com/collections/keyboards/products/halo75-v2-qmk-via-wireless-custom-mechanical-keyboard?variant=41037254197357\">new Nuphy keyboard</a> with silent red clear top switches, featuring RGB lighting. Matt reveals he recently ordered a <a href=\"https://nuphy.com/collections/keyboards/products/air75-v2\">Nuphy Air 75 v2</a> after being influenced by Dillon. This leads to a brief discussion about potentially dedicating an entire episode to keyboards.</p>\n<h3>Engineering Levels Discussion</h3>\n<ul>\n<li><strong>Introduction:</strong> The main topic shifts to engineering levels and promotions. They discuss the convoluted process of getting promoted and the often vague nature of career ladders.</li>\n<li><strong>Promotions</strong>: Dillon suggests openly communicating promotion goals to managers early on and highlights finding a new job as another way to move up.</li>\n<li><strong>Level Alignment</strong>: They acknowledge that engineering levels are not uniform across companies. A &quot;senior&quot; at one company might be a &quot;junior&quot; or &quot;staff&quot; at another. More competitive companies may make it harder to get higher-level titles.</li>\n<li><strong>Fast Growth:</strong> They discuss the pros and cons of moving up the career ladder quickly and the importance of confidence and continuous learning. It’s also good to feel confident that you could interview and find a new job.</li>\n<li><strong>Company Growth:</strong> The podcast touches on companies growing quickly can provide opportunity for advancement in titles.</li>\n<li><strong>Lateral Growth</strong>: The hosts discuss the importance of lateral growth within a level to increase skillset. Seeking opportunities to grow and learn new things will make you more hireable in the future.</li>\n<li><strong>Company Needs</strong>: The hosts emphasize identifying and solving company-wide problems as a way to stand out and grow within an organization.</li>\n<li><strong>Leverage</strong>: Leverage is built through information and relationships. Leverage builds up over time in an organization and you begin to be able to better deliver results.</li>\n</ul>\n<h3>Building Connections</h3>\n<ul>\n<li><strong>Networking:</strong> The hosts discuss the importance of building a strong network across the company. Dillon recommends setting up one-on-ones with team members to understand their roles better.</li>\n<li><strong>Be Nice:</strong> Genuine excitement about connections lead to great relationships.</li>\n<li><strong>Authenticity</strong>: It&#x27;s important to create genuine friendships at work and enjoy the time spent with colleagues.</li>\n<li><strong>Teach</strong>: Teach people selflessly.</li>\n</ul>\n<h3>Conclusion</h3>\n<p>The hosts wrap up the discussion, emphasizing that levels matter differently to different people and depending on what their professional goals are. It&#x27;s important to pursue constant growth and balance career aspirations with personal satisfaction.</p>\n<h3>Stand-up Updates</h3>\n<ul>\n<li>  Scott discusses his laid-back onboarding experience at Airbnb and his excitement about the new role.</li>\n<li>  Dillon shares his success with morning workouts after adjusting his sleep schedule.</li>\n<li>  Matt discusses his on-site event, tinkering with Obsidian and <a href=\"https://tinybase.org/\">TinyBase</a>, and his anticipation for his new keyboard.</li>\n</ul>","audioURL":"https://assets.bikeshedpod.com/episodes/7/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/7/captions.vtt","slug":"ditch-the-career-ladder","fileSizeBytes":64775023},{"episodeId":"6","title":"Scratching the Surface on Design Systems","shortDescription":"The gang talks all about design systems, ranging from what they are, why you may (or may not) need one, and then share a few spicy takes on Storybook, modals, and Tailwind!","hosts":[{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["design-systems","storybook","tailwind","shadcn"],"publishTime":1744408817526,"duration":3298,"longDescription":"<link rel=\"preload\" as=\"image\" href=\"https://bikeshedpod.com/mr-krabs.jpeg\"/><h2>Summary:</h2>\n<p>This episode of The Bikeshed Podcast covers design systems, including their benefits, trade-offs, and whether your company needs one. The hosts also share experiences from their time working on a design system team at Wayfair. Segments include stand-up updates, &quot;Two Takes and a Fake,&quot; and &quot;Spicy Takes with Curry.&quot;</p>\n<h3>Stand-up Updates</h3>\n<ul>\n<li><strong>Dillon</strong>: Shifted to a new project requiring more help. He is listening to the audiobook &quot;Sapiens.&quot;</li>\n<li><strong>Matt</strong>: Exploring the <a href=\"https://www.npmjs.com/package/@cloudflare/vite-plugin\">Cloudflare Vite plugin</a>, which allows building a worker and a client-side app. Also experimenting with <a href=\"https://tinybase.org/\">TinyBase</a>, a sync engine for web applications.</li>\n<li><strong>Scott</strong>: Took time off before starting a new job. He completed home improvement projects such as re-grouting tiles and fixing a couch leg. Updated the Bikeshed Podcast logo and metadata. Started working on an incremental Bun compiler and playing around with a Moon monorepo.</li>\n</ul>\n<h3>Design Systems Discussion</h3>\n<ul>\n<li><strong>Benefits</strong>: Design systems are helpful, especially in larger corporations, as they standardize UI, increase speed, create brand consistency, and ease rebranding. They establish a UI contract between designers, engineers, and product teams.</li>\n<li><strong>Considerations</strong>: Smaller companies might benefit more from solutions like Shadcn, where components are consumed into the application. The team should also be responsible for contributing back. Design systems should be flexible and adapt to user needs. It is important to take an empathetic approach to use cases.</li>\n<li><strong>Wayfair Experience</strong>: The team discusses their experience working on a design system at Wayfair, highlighting the importance of a single source of truth for design. They also discussed the value of patterns and collaborative environment for creativity and continuous improvement. The team started rigid and inflexible, but matured to provide more flexibility for the teams they were supporting.</li>\n<li><strong>Component Libraries vs. Design Systems</strong>: A component library is one piece of a design system. Component libraries are more of a starting point, less rigid, and more flexible, whereas design systems are more opinionated and include non-tangible elements like guidelines and documentation.</li>\n<li><strong>Organization Size</strong>: Organization size impacts the design system. Large companies benefit from large investments in platform tooling. Design systems require dedicated people to think about them and the best way to set them up.</li>\n<li><strong>Selling the Value</strong>: It is often hard to quantify and sell the value of what the team is doing. Tools that show adoption can help leaders see the value of a design system.</li>\n</ul>\n<h3>Spicy Takes</h3>\n<p>Tune in to hear the takes that Dillon and Matt share to make Scott react like Mr Krabs:</p>\n<p><div class=\"flex items-center justify-center\"><img src=\"https://bikeshedpod.com/mr-krabs.jpeg\" alt=\"An image of Mr. Krabs from Spongebob, with a dizzy-like effect around him\"/></div></p>\n<h3>Two Takes and a Fake</h3>\n<p>The hosts play a game where they identify the fake tech-related news among two real ones. This week&#x27;s topics were Bun, Vercel changelog, and Next.js.</p>\n<blockquote>\n<p>Tune in to hear who wins this week!</p>\n</blockquote>","audioURL":"https://assets.bikeshedpod.com/episodes/6/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/6/captions.vtt","slug":"scratching-the-surface-on-design-systems","fileSizeBytes":79150729},{"episodeId":"5","title":"Testing - Is It Worth It?!?","shortDescription":"The gang discusses all things software testing, from manual verification to automated tests and other things you can do to ensure stability!","hosts":[{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["automated-testing","spicy-takes","unit-testing","end-to-end-testing"],"publishTime":1743630067411,"duration":4090,"longDescription":"<link rel=\"preload\" as=\"image\" href=\"https://bikeshedpod.com/testing-midwit-meme.png\"/><h2>Summary:</h2>\n<p>This episode of the Bikeshed Podcast features a discussion about software testing, with a focus on automated testing in frontend development. The hosts, Scott Kaye, Matt Hamlin, and Dillon Curry, explore various testing methodologies, tools, and their value in different contexts. They delve into the nuances of unit, integration, and end-to-end testing, and the trade-offs involved in choosing one over the other. The discussion also touches on the role of mocking, dependency injection, and the importance of balancing test coverage with development speed. They each share personal experiences from their development career on testing, and their favorite tools.</p>\n<p>Key Discussion Points:</p>\n<ul>\n<li>Value of Testing: Testing is often not enjoyable in the short term, but provides significant long-term value by preventing bugs and providing confidence in code changes.</li>\n<li>Unit Testing vs. Integration/End-to-End: Unit testing is valuable for specific functions, while integration and end-to-end tests are better for critical user flows. However, end-to-end tests can be flaky.</li>\n<li>Mocking: The overuse of mocking can reduce the value of tests. Dependency injection is viewed more favorably than mocking, though they serve similar purposes.</li>\n<li>Test Coverage: Aiming for 100% test coverage may not be efficient; focus on testing essential product features. Consider the time and effort spent on tests versus the value they provide.</li>\n<li>Testing in Production: The hosts explore the concept of testing in production, with tools like Datadog synthetics. This allows the team to assess the experience for end-users in production.</li>\n</ul>\n<figure><img src=\"https://bikeshedpod.com/testing-midwit-meme.png\" alt=\"A graphic showing the bell curve distribution of IQ score, the low end shows a comical depiction of a head with the text &#x27;test in prod&#x27; above it, the middle shows another head with the text &#x27;build a pristine hermetic environment to run tests against that matches prod 1:1&#x27;, and the right hand side also shows a head with the text &#x27;test in prod&#x27;.\"/><p><figcaption>The &quot;midwit&quot; meme reference that Matt made during the episode</figcaption></p></figure>\n<ul>\n<li>Test-Driven Development (TDD): TDD may not always be practical, especially when developing new features with unknown outputs. Writing tests after the feature is more common in these scenarios.</li>\n<li>Proof of Concept (POC): Developing a proof of concept outside the main application to validate an idea before integrating it is valuable.</li>\n<li>Accessibility Testing: The importance of accessibility testing is discussed, but integrating it into the development process is important.</li>\n<li>Component Tests: A discussion of testing in isolation to ensure true browser experience. Component testing will ensure the system will run in the browser as expected.</li>\n<li>Code and Test Half-Life: Tests lose value over time as codebase patterns change. It&#x27;s important to re-evaluate their relevance.<!-- -->\n<ul>\n<li><a href=\"https://matthamlin.me/blog/2018/december/testing-software\">Referenced blog post on the half-life of code and tests</a></li>\n</ul>\n</li>\n</ul>\n<h3>Spicy Takes:</h3>\n<blockquote>\n<p>Tune in to the episode to hear all our spicy takes on testing!</p>\n</blockquote>\n<h3>Misc. References:</h3>\n<p>Scott shared a few Neovim related projects that he has been working with:</p>\n<ul>\n<li><a href=\"https://github.com/folke/snacks.nvim\">Folke Snacks.nvim</a></li>\n<li><a href=\"https://github.com/folke/lazy.nvim\">Folke Lazy.nvim</a></li>\n<li><a href=\"https://github.com/folke/flash.nvim\">Folke Flash.nvim</a></li>\n<li><a href=\"https://github.com/yetone/avante.nvim\">Avante.nvim</a></li>\n</ul>","audioURL":"https://assets.bikeshedpod.com/episodes/5/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/5/captions.vtt","slug":"testing-is-it-worth-it","fileSizeBytes":98158259},{"episodeId":"4","title":"Perfecting The Pull Request","shortDescription":"The guys discuss best practices for code review, with a focus on creating effective pull requests (PRs) and how to approach reviewing code.","hosts":[{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["code-review","pull-requests","pair-programming","pair-reviewing","live-reviewing","automated-testing","spicy-takes"],"publishTime":1743447007902,"duration":3159,"longDescription":"<h2>Summary:</h2>\n<p>This episode of the Bikeshed Podcast features Scott Kaye, Matt Hamlin, and Dillon Curry discussing best practices for code review, with a focus on creating effective pull requests (PRs) and how to approach reviewing code.</p>\n<p>Creating Great Pull Requests</p>\n<ul>\n<li>Context is Key: Highlight the problem being solved, the goal of the PR, and the solution chosen. Explain why this solution was selected over alternatives.</li>\n<li>Scope: PRs should be isolated to a single problem or feature.</li>\n<li>Rollback: Consider and outline the rollback procedure for changes.</li>\n<li>Templates: Minimal templates with &quot;context&quot; and &quot;details&quot; sections are generally preferred. &quot;Alternatives Considered&quot; can be a useful addition.</li>\n<li>Self-Review: Conduct a self-review of the code, ideally within the GitHub PR interface, to identify potential issues.</li>\n<li>Draft Mode: Utilizing draft PRs is helpful for iterative development and early feedback.</li>\n<li>Visual Aids: Include screenshots, screen recordings, and preview deploys to contextualize changes, especially for UI-related PRs. Dev tool screenshots can be helpful.<!-- -->\n<ul>\n<li><a href=\"https://developer.chrome.com/blog/devtools-tips-33\">How to capture full-size screenshots within Chrome Devtools</a></li>\n<li><a href=\"https://matthamlin.me/blog/2025/march/replacing-dropbox-capture-with-raycast\">Matt&#x27;s replacement for Dropbox Capture</a></li>\n</ul>\n</li>\n<li>Tests: Defer writing tests until a solid solution and some initial feedback have been received to avoid wasted effort due to significant code changes.</li>\n</ul>\n<p>Reviewing Code Effectively</p>\n<ul>\n<li>Understand the Big Picture: Start by understanding the problem being solved and the overall goal of the PR.</li>\n<li>Use Available Context: Utilize videos, screenshots, and preview deploys to understand the changes.</li>\n<li>Prioritize: Focus on major changes and save minor issues for a second pass.</li>\n<li>&quot;What, Why, How&quot; Approach: Consider what the change does, why it&#x27;s being made, and how it&#x27;s implemented.</li>\n<li>Live Reviews/Pairing: For complex changes, consider live reviews or pair programming to accelerate feedback and build shared understanding. However, acknowledge that this is not always feasible due to time constraints.</li>\n<li>Knowledge Sharing: Use code reviews as an opportunity to onboard team members and share knowledge.</li>\n</ul>\n<p>Spicy Takes (and Not-So-Spicy Takes)</p>\n<ul>\n<li>Code review maybe is not needed: It was suggested in certain situations, code review may not be necessary. This take was received as extremely situational.</li>\n<li>You should almost never have to do two code reviews This take was received as neither mild or spicy, more so cold and lukewarm.</li>\n</ul>\n<p>What&#x27;s Up With You? (Stand-up Updates)</p>\n<ul>\n<li>Dillon: Was looking into something called embargoed assets in Contentful.</li>\n<li>Scott: Learned about animating on scroll videos and pictures in React using the Canvas tag, bypassing React&#x27;s re-rendering limitations.</li>\n<li>Matt: Investigating Content Security Policy (CSP) and durable objects on Cloudflare.</li>\n</ul>","audioURL":"https://assets.bikeshedpod.com/episodes/4/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/4/captions.vtt","slug":"perfecting-the-pull-request","fileSizeBytes":75831088},{"episodeId":"3","title":"A Day In The Life: Coding, Coffee, and Commit Messages","shortDescription":"The guys talk about their daily routines, how they remain productive, and then share spicy hot takes!","hosts":[{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["routine","ai","design-systems","two-takes-and-a-fake","spicy-takes","note-taking"],"publishTime":1742995962545,"duration":2303,"longDescription":"<h2>Summary:</h2>\n<p>In this episode of the Bikeshed Podcast, the gang dives into their daily routine exploring their productivity habits and workflows. They also get down and dirty on discussing their spicy takes.</p>\n<p>Daily Routines for Productivity</p>\n<ul>\n<li>Matt: Starts his day with a morning walk and uses Obsidian as a central hub for notes and task management. He reviews notes and Slack to identify action items. He also notes that he finds opportunities to make improvements on other things while doing a given task and acts on it instead of simply noting it.</li>\n<li>Scott: Begins with coffee, checks personal and work emails and Slack, reviews his calendar, and focuses with his headphones and vibes with music.. He uses Obsidian, Notion, or Notes to track tasks and goals, breaking down complex tasks into smaller, manageable parts. He also prioritizes clear communication and task articulation to minimize disruptions.</li>\n<li>Dillon: Prefers working from the office for increased productivity. He maps out his day with a &quot;stand-up update&quot; and clears his email and Slack to minimize distractions and enable focused work periods.</li>\n</ul>\n<p>Follow-up on Daily Routines</p>\n<ul>\n<li>Matt and Scott both use end-of-day summaries to set the stage for the next day.</li>\n<li>Dillon prefers the office to WFH and does not perform an end-of-day summary and stated it&#x27;s something he could work on.</li>\n<li>Matt uses an &quot;outcomes&quot; section in his daily notes to track accomplishments and artifacts, aiding in reviews and progress tracking over time.</li>\n</ul>\n<p>Spicy Takes</p>\n<ul>\n<li>Dillon (Medium): React components often abuse props, violating the single responsibility principle due to a lack of care or education.</li>\n<li>Scott (Hot): Design systems should empathetically conform to user needs and not try to influence design in a specific direction. A bolder take was that design systems shouldn&#x27;t exist at all.</li>\n<li>Matt (Hot Fire): We should not always assume good intent when reviewing code or understanding legacy systems. Sometimes, it&#x27;s necessary to challenge decisions and consider alternative paths.</li>\n</ul>\n<p>Two Takes and a Fake</p>\n<p>The hosts played a round of &quot;Two Takes and a Fake,&quot; a game where they presented three tech-related statements (two real, one fake) and challenged each other to identify the fabrication. Who will win? Tune in and find out!</p>\n<p>What&#x27;s New</p>\n<ul>\n<li>Scott: Been working with UI heavy work to animate webm video files on scroll. Check out the homepage of <a href=\"https://tollbit.com/\">Tollbit</a></li>\n<li>Matt: Released <a href=\"https://github.com/hamlim/vndr/tree/main/packages/vndr\">Vndr</a>, a CLI tool for vendoring (inlining) packages.</li>\n</ul>","audioURL":"https://assets.bikeshedpod.com/episodes/3/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/3/captions.vtt","slug":"a-day-in-the-life-coding-coffee-and-commit-messages","fileSizeBytes":55287558},{"episodeId":"2","title":"Is The Web Getting Worse?!?!?","shortDescription":"Scott and Matt talk about how things have been feeling worse on the internet in recent years, and how everything has focused on incremental optimizations over large innovations.","hosts":[{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["enshittification","shadcn","ai","innovation","optimization"],"publishTime":1742393660624,"duration":3888,"longDescription":"<h2>Summary:</h2>\n<p>This episode of the Bikeshed Podcast explores the concept of &quot;enshittification,&quot; the idea that the quality of products and services deteriorates over time, often accompanied by increased monetization and decreased customer value. They further discuss how this relates to web development and the broader tech industry. They explore potential cultural factors behind this.</p>\n<p>Key Discussion Points:</p>\n<ul>\n<li>Enshittification Examples: The hosts provide examples of enshittification in popular services like Spotify (increased ads with subscription) and Netflix (higher prices for premium features). Facebook is also mentioned as a product that has seemingly declined in popularity as it has aged.</li>\n<li>AI Integration: The hosts discussed the trend of tacking on AI to products just to say that they offer AI features, which can often be annoying and not serve the original purpose of the product.</li>\n<li>Lost Focus on User Needs: They discuss how companies sometimes lose sight of their original mission and focus more on monetization through KPIs rather than solving customer needs. The hosts share that as measures become metrics, they become less valuable over time.</li>\n<li><a href=\"https://grantslatton.com/nobody-cares\">&quot;Nobody Cares&quot; Blog Post</a>: They discuss the Grant Slatton blog post, interpreting it as a reflection of how engineers may be disempowered from caring about the overall product due to narrow focus and lack of agency in larger organizations.</li>\n<li>“Shadification of the Web”: They introduce the term &quot;shadification&quot; to describe the growing trend of websites looking the same due to the widespread use of component libraries like Shadcn/ui (copy-paste) along with Material UI and Bootstrap.</li>\n<li>Optimization vs. Innovation: They discuss how companies often prioritize optimization and A/B testing over true innovation, resulting in a lack of creativity and unique user experiences.</li>\n<li>Performance Costs: Optimizations made at the expense of performance degrade the customer experience.</li>\n<li>Blurred Ownership: In larger companies, it becomes harder to draw ownership lines when there are more people owning things and there isn&#x27;t clear defined guidelines.</li>\n<li>Impact of AI on UI Creativity: The hosts explore the potential for AI to further standardize UI patterns and stifle creativity, as AI models are trained on existing designs and may not generate truly novel solutions.</li>\n<li>AI Dependency: Discussion of companies choosing to support new libraries based on the amount of support AI models know about them and recommend them, which can lead to everything becoming the same.</li>\n</ul>\n<p>Personal Updates:</p>\n<ul>\n<li>Scott has been digging into <a href=\"https://github.com/yetone/avante.nvim\">Avante</a>, finding it helpful for learning Go. He plans to build a backend service in Node and then refactor it to Go as a learning exercise.</li>\n<li>Matt has been experimenting with Cursor&#x27;s Composer agent feature and a tool called <a href=\"https://block.github.io/goose/\">Codename Goose</a>, which uses AI to infer functionality on his computer.</li>\n</ul>","audioURL":"https://assets.bikeshedpod.com/episodes/2/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/2/captions.vtt","slug":"is-the-web-getting-worse","fileSizeBytes":93307007},{"episodeId":"1","title":"Vibe Coding When The Vibes Are Off","shortDescription":"Dillon, Matt & Scott dive into AI's impact on coding, discussing its role in daily work, how to use it effectively, and balancing creativity with automation in 2025.","hosts":[{"name":"Dillon Curry","socials":{"github":"https://github.com/illourr","website":"https://dilloncurry.vercel.app/"}},{"name":"Scott Kaye","socials":{"bluesky":"https://bsky.app/profile/scottykaye.com","github":"https://github.com/scottykaye/","website":"https://scottykaye.com/"}},{"name":"Matt Hamlin","socials":{"bluesky":"https://bsky.app/profile/matthamlin.me","github":"https://github.com/hamlim/","website":"https://matthamlin.me/"}}],"metadata":["ai","vibe-coding","software-engineering","learning-zone"],"publishTime":1742226011815,"duration":3544,"longDescription":"\n<p><a href=\"https://dilloncurry.vercel.app/\">Dillon</a>, <a href=\"https://matthamlin.me/\">Matt</a> &amp; <a href=\"https://scottykaye.com/\">Scott</a> record an episode with some semblance of quality.</p>\n<p>The gang dove directly into software&#x27;s hottest topic: AI. We believe in using AI in your day to day job to be more successful.</p>\n<p>In this episode we discuss;</p>\n<ul>\n<li>use cases for AI in software development,</li>\n<li>the fun tasks AI has taken away and,</li>\n<li>how to be successful using AI tools.</li>\n</ul>\n<p>Listen to us explain navigating writing code in a world where more and more companies are increasingly advocating the usage of AI at your day job.</p>\n<p>How do we continue to learn and grow as human while still maintaining fun, creativity and human interaction as an engineer in 2025?</p>\n<p>AI is a powerful tool used correctly, however that AI will submit to confirmation bias and your role is to prompt AI to be as unbiased as possible to the best of your ability.</p>\n<h3>Episode Summary:</h3>\n<p>In this episode of The Bikeshed Podcast, hosts Scott Kaye, Matt Hamlin, and Dillon Curry discuss the role of AI in software development, sharing their experiences with various AI-powered tools and debating the impact of AI on engineering workflows, learning, and job satisfaction.</p>\n<p>Key Topics Discussed:</p>\n<ol>\n<li>AI in Software Development</li>\n</ol>\n<ul>\n<li>The hosts discuss how AI has become integral to software engineering, particularly for writing code and automating tasks.</li>\n<li>Matt introduces the main discussion: how AI is used in development today and the broader implications of its adoption.</li>\n</ul>\n<ol start=\"2\">\n<li>Preferred AI Tools</li>\n</ol>\n<ul>\n<li>Dillon shares that he used Cursor until his company restricted it, forcing him to switch to Copilot, which he finds inferior.</li>\n<li>Scott uses NeoVim with NeoCodium and Avante, but acknowledges their limitations compared to Cursor.</li>\n<li>Matt relies on Cursor at work, noting that his company prefers it over other AI tools.</li>\n</ul>\n<ol start=\"3\">\n<li>AI&#x27;s Impact on Development</li>\n</ol>\n<ul>\n<li>AI enables developers to work faster but can remove the learning process.</li>\n<li>Over-reliance on AI can lead to shallow understanding of code and a decrease in creativity.</li>\n<li>AI often acts like a junior engineer whose code must be reviewed, making debugging a larger part of the job.</li>\n<li>Using AI can lead to less collaboration with teammates, as developers tend to consult AI over their colleagues.</li>\n</ul>\n<ol start=\"4\">\n<li>Concerns About AI in Software Engineering</li>\n</ol>\n<ul>\n<li>Some engineers feel less engaged with their work as AI handles boilerplate and repetitive tasks.</li>\n<li>AI&#x27;s agreeable nature can reinforce incorrect assumptions, leading to confirmation bias.</li>\n<li>Companies may use AI to increase efficiency and reduce hiring, raising concerns about job displacement.</li>\n</ul>\n<ol start=\"5\">\n<li>AI vs. Traditional Search (Google)</li>\n</ol>\n<ul>\n<li>Unlike Google, where users must craft precise search queries, AI allows more fluid back-and-forth conversations.</li>\n<li>AI can provide immediate answers but might not always offer the best or most optimized solution.</li>\n</ul>\n<ol start=\"6\">\n<li>The “No AI” Challenge</li>\n</ol>\n<ul>\n<li>The hosts agree to a two-and-a-half-day challenge of coding without AI, to evaluate how it affects their work and problem-solving abilities.</li>\n</ul>\n<ol start=\"7\">\n<li>Game Segment – “Two Takes and a Fake”</li>\n</ol>\n<ul>\n<li>Scott introduces a new segment where Matt and Dillon guess which of three AI-related tweets is fake.</li>\n<li>Matt wins this round, showing a keen eye for spotting AI discourse trends.</li>\n</ul>\n<ol start=\"8\">\n<li>What&#x27;s New?</li>\n</ol>\n<ul>\n<li>Dillon is learning piano and music theory to slow down and disconnect from work.</li>\n<li>Matt is exploring Cloudflare workers and running Deepseek R1 locally for AI experimentation.</li>\n<li>Scott is focused on improving his Golang skills and debating Cherry Pepsi Zero vs. Cherry Coke Zero.</li>\n</ul>\n<ol start=\"9\">\n<li>Closing Thoughts</li>\n</ol>\n<ul>\n<li>The hosts discuss burnout, learning in tech, and how side projects keep programming fun.</li>\n<li>They tease next week&#x27;s episode on burnout and side projects.</li>\n</ul>\n<p>The episode wraps up with some lighthearted banter and a call for listeners to like, subscribe, and share.</p>","audioURL":"https://assets.bikeshedpod.com/episodes/1/audio.mp3","captionURL":"https://assets.bikeshedpod.com/episodes/1/captions.vtt","slug":"vibe-coding-when-the-vibes-are-off","fileSizeBytes":85070912}]